In [1]:
import pandas as pd

In [2]:
df_dict = {'Name':['A','B','C'],
          'Salary':[1,2,3]}

In [8]:
df = pd.DataFrame(df_dict)

In [10]:
df[['Name']]

  Name
0    A
1    B
2    C

In [11]:
df = pd.read_csv('emp.csv')

In [14]:
df_10 = df['deptno'] == 10

In [26]:
df_10_20 =df[(df['deptno'] == 20) & (df['salary'] >2000)]

In [27]:
df_10_20

    eno   ename  salary  deptno         doj
6     7  Robert    3000      20  2023-06-25
11   12   Karan    2200      20  2018-06-16

In [30]:
df.sort_values(by = 'deptno', ascending = False,inplace = True)

In [31]:
df

    eno   ename  salary  deptno         doj
7     3    Nick    1000      30  2015-09-15
10   11  Dennis   41000      30  2024-01-05
9     1   Vikas    1000      30  2017-10-03
8     9   Naman    4000      30  2020-01-20
13   14    Amit    2000      30  2022-04-09
2     8   Sagar    1000      20  2020-11-30
6     7  Robert    3000      20  2023-06-25
11   12   Karan    2200      20  2018-06-16
14   15    Neha    1700      20  2021-07-22
4     5    Jade    2000      10  2021-02-10
1     2    Amar    1000      10  2017-03-22
3     4  Thomas    1000      10  2019-08-18
0    10   Amber    1000      10  2018-05-14
5     6   Smith    1000      10  2016-12-01
12   13  Simran    1500      10  2019-12-19
15   16   Rahul    1200      10  2016-03-28